IDENTIFICATION DIVISION.
PROGRAM-ID. FUEL-MASS.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL. 


DATA DIVISION.
    FILE SECTION. 
    FD SYSIN. 
    01 INPUT-LINE PIC X(6).
    88 EOF VALUE HIGH-VALUES.
    
    WORKING-STORAGE SECTION.
    01 WS-CALCULATE. 
        05 MODULE-MASS PIC 9(6).
        05 DIVISOR PIC 9 VALUE 3.
        05 MODULE-FUEL PIC 9(6).
        05 TOTAL-FUEL PIC 9(9) VALUES 0. 

    
PROCEDURE DIVISION.

    0000-MAIN.
        OPEN INPUT SYSIN.
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ.
        PERFORM 0100-CACULATE-FUEL UNTIL EOF.
        DISPLAY TOTAL-FUEL.
        PERFORM 9000-END-PROGRAM.
    0000-END.
    
    0100-CACULATE-FUEL.
        MOVE INPUT-LINE TO MODULE-MASS.
        COMPUTE MODULE-FUEL = (MODULE-MASS / DIVISOR) - 2.
        
        IF MODULE-FUEL > 0 
            ADD MODULE-FUEL TO TOTAL-FUEL
        END-IF.
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ.
    0100-END.
    
    9000-END-PROGRAM.
        CLOSE SYSIN.
        STOP RUN.
    9000-END.

END PROGRAM FUEL-MASS.
