IDENTIFICATION DIVISION.
PROGRAM-ID. FUEL-MASS.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL. 


DATA DIVISION.
    FILE SECTION. 
    FD SYSIN. 
    01 INPUT-LINE PIC X(6).
    88 EOF VALUE HIGH-VALUES.
    
    WORKING-STORAGE SECTION.
    01 WS-CALCULATE-MODULE-FUEL. 
        05 MODULE-MASS PIC 9(6).
        05 DIVISOR PIC 9 VALUE 3.
        05 MODULE-FUEL PIC 9(6).
        05 TOTAL-FUEL PIC 9(9) VALUES 0. 
    
    01 WS-CACLULATE-FUEL-FOR-FUEL.
        05 REMAINING-FUEL PIC 9(6).
        05 TOTAL-ADDITIONAL-FUEL PIC 9(6).
        05 MINIMUM-WEIGHT PIC 9 VALUE 9.
        05 FILLER PIC 9(1).
            88 FINISHED-CALC VALUE 1.
            88 NOT-FINISHED-CALC VALUE 0.
        
    
PROCEDURE DIVISION.

    0000-MAIN.
        OPEN INPUT SYSIN.
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ.
        PERFORM 0100-CACULATE-FUEL UNTIL EOF.
        DISPLAY TOTAL-FUEL.
        PERFORM 9000-END-PROGRAM.
    0000-END.
    
    0100-CACULATE-FUEL.
        MOVE INPUT-LINE TO MODULE-MASS.
        COMPUTE MODULE-FUEL = (MODULE-MASS / DIVISOR) - 2.
        
        IF MODULE-FUEL > 0 
            ADD MODULE-FUEL TO TOTAL-FUEL
            SET NOT-FINISHED-CALC TO TRUE
            MOVE 0 TO TOTAL-ADDITIONAL-FUEL
            MOVE MODULE-FUEL TO REMAINING-FUEL
            PERFORM 0200-CALCULATE-FUEL-FOR-FUEL UNTIL FINISHED-CALC
        END-IF.
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ.
    0100-END.
    
    0200-CALCULATE-FUEL-FOR-FUEL.
        COMPUTE REMAINING-FUEL = REMAINING-FUEL / DIVISOR - 2.
        ADD REMAINING-FUEL TO TOTAL-ADDITIONAL-FUEL. 
        IF REMAINING-FUEL < MINIMUM-WEIGHT
            SET FINISHED-CALC TO TRUE
            ADD TOTAL-ADDITIONAL-FUEL TO TOTAL-FUEL
        END-IF.
    0200-END.
    
    9000-END-PROGRAM.
        CLOSE SYSIN.
        STOP RUN.
    9000-END.

END PROGRAM FUEL-MASS.
