IDENTIFICATION DIVISION.
PROGRAM-ID. WIREFIRE.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL. 

DATA DIVISION.
    FILE SECTION. 
    FD SYSIN. 
    01 FILE-INPUT-LINE PIC X(2000).
    88 EOF VALUE HIGH-VALUES.
    
WORKING-STORAGE SECTION.
    01  X-INPUT-LINE                     PIC X(2000).
    01  X-SEP-CHAR                       PIC X(1).
    01  FIRST-WIRE-TABLE.
        02 FIRST-CMAX                          PIC 9(5) COMP-3.
        02 FIRST-WIRE-ARRAY OCCURS 0 TO 9999 TIMES DEPENDING ON FIRST-CMAX.
            07 VAL           PIC X(5).
    
    01  SECOND-WIRE-TABLE.
        02 SECOND-CMAX                          PIC 9(5) COMP-3.
        02 SECOND-WIRE-ARRAY OCCURS 0 TO 9999 TIMES DEPENDING ON SECOND-CMAX.
            07 VAL           PIC X(5).
    
    01  BOARD-TABLE-X OCCURS 20000 TIMES.
        05 BOARD-TABLE-Y OCCURS 20000 TIMES.
            10 FIRST-WIRE PIC X VALUE 'N'.
                88 FIRST-WIRE-PRESENT VALUE 'Y'.
                88 FIRST-WIRE-NOT-PRESENT VALUE 'N'.
            10 SECOND-WIRE PIC X VALUE 'N'.
                88 SECOND-WIRE-PRESENT VALUE 'Y'.
                88 FIRST-WIRE-NOT-PRESENT VALUE 'N'.
                
    01  BOARD-CENTER    PIC 9(6) VALUE 010000.
            
            
    01  INTERSECTIONS.
        02 INT-COUNT    PIC 9(5) COMP-3.
        02 INTERSECT-COORDINATES OCCURS 0 TO 9999 TIMES DEPENDING ON INT-COUNT.
        05 X-CORD       PIC 9(6).
        05 Y-CORD       PIC 9(6).

    
    01 DISP9-5                          PIC ZZZZ9.
    01 COUNTER                          PIC 9(5) COMP-3.
    01 SPACE-COUNTER                    PIC 9(5) COMP-3.
    
    01 WS-WIRE-INDEXES.
        05 FIRST-WIRE-X-COUNTER             PIC 9(6).
        05 FIRST-WIRE-Y-COUNTER             PIC 9(6).
        05 SECOND-WIRE-X-COUNTER            PIC 9(6).
        05 SECOND-WIRE-Y-COUNTER            PIC 9(6).
        
    01 WS-MANHATTAN.
        05 SMALLEST-MANHATTAN           PIC 9(6).
        05 COMPARE-MANHATTAN            PIC 9(6).
        05 Y-DIST                       PIC 9(6).
        05 X-DIST                       PIC 9(6).
    
    01 WIRE-ONE-LINE.
        05 DIRECTION PIC X(1).
        05 LEN PIC 9(4).
        
    01 WHICH-WIRE PIC 9(1).
        88 DRAW-FIRST-WIRE VALUE 1.
        88 DRAW-SECOND-WIRE VALUE 0. 
        
    01 WS-DIRECTIONS.
        05 DIR-UP PIC X VALUE 'U'.
        05 DIR-DOWN PIC X VALUE 'D'.
        05 DIR-LEFT PIC X VALUE 'L'.
        05 DIR-RIGHT PIC X VALUE 'R'.

    
PROCEDURE DIVISION.
0000-MAIN.
    DISPLAY 'INIT'
    PERFORM 0050-READ-WIRE-PATHS-TO-TABLES
    PERFORM 0200-DRAW-BOARD
    DISPLAY INT-COUNT OF INTERSECTIONS
    PERFORM 0400-FIND-SHORTEST-MANHATTAN-DISTANCE
    DISPLAY 'Shortest distance: 'SMALLEST-MANHATTAN
    STOP RUN.

0050-READ-WIRE-PATHS-TO-TABLES.
    OPEN INPUT SYSIN.
    READ SYSIN.
    MOVE FILE-INPUT-LINE TO X-INPUT-LINE
    MOVE ',' TO X-SEP-CHAR
    CALL 'SEP' USING X-INPUT-LINE X-SEP-CHAR FIRST-WIRE-TABLE
    DISPLAY 'SEP says the first wire, seperated by "' X-SEP-CHAR
          '" has the following number of entries: ' FIRST-CMAX
    END-DISPLAY
    
    READ SYSIN
    MOVE FILE-INPUT-LINE TO X-INPUT-LINE
    MOVE ',' TO X-SEP-CHAR
    CALL 'SEP' USING X-INPUT-LINE X-SEP-CHAR SECOND-WIRE-TABLE
    DISPLAY 'SEP says the second wire, seperated by "' X-SEP-CHAR
          '" has the following number of entries: ' SECOND-CMAX
    END-DISPLAY
    .
0050-END.

0200-DRAW-BOARD.
    MOVE BOARD-CENTER TO FIRST-WIRE-X-COUNTER
    MOVE BOARD-CENTER TO FIRST-WIRE-Y-COUNTER
    MOVE BOARD-CENTER TO SECOND-WIRE-X-COUNTER
    MOVE BOARD-CENTER TO SECOND-WIRE-Y-COUNTER
    MOVE 0 TO COUNTER
    PERFORM FIRST-CMAX TIMES 
# Doing this lazy instead of in a separate program
# One cannot pass parameters within a cobol program :)))
        ADD 1 TO COUNTER 
        MOVE 0 TO SPACE-COUNTER
        MOVE FIRST-WIRE-ARRAY(COUNTER)(1:1) TO DIRECTION
        INSPECT FIRST-WIRE-ARRAY(COUNTER) TALLYING 
            SPACE-COUNTER FOR CHARACTERS BEFORE SPACE
        SUBTRACT 1 FROM SPACE-COUNTER 
        MOVE FIRST-WIRE-ARRAY(COUNTER)(2:SPACE-COUNTER) TO LEN
        SET DRAW-FIRST-WIRE TO TRUE
        PERFORM 0300-DRAW-WIRE
        
        MOVE 0 TO SPACE-COUNTER
        MOVE SECOND-WIRE-ARRAY(COUNTER)(1:1) TO DIRECTION
        INSPECT SECOND-WIRE-ARRAY(COUNTER) TALLYING 
            SPACE-COUNTER FOR CHARACTERS BEFORE SPACE
        SUBTRACT 1 FROM SPACE-COUNTER 
        MOVE SECOND-WIRE-ARRAY(COUNTER)(2:SPACE-COUNTER) TO LEN
        SET DRAW-SECOND-WIRE TO TRUE
        PERFORM 0300-DRAW-WIRE
    END-PERFORM
    .
0200-END.

0300-DRAW-WIRE.
    IF DRAW-FIRST-WIRE
        EVALUATE DIRECTION
            WHEN DIR-UP
                PERFORM LEN TIMES
                    ADD 1 TO FIRST-WIRE-Y-COUNTER
                    SET FIRST-WIRE-PRESENT(FIRST-WIRE-X-COUNTER,FIRST-WIRE-Y-COUNTER) TO TRUE 
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-LEFT 
                PERFORM LEN TIMES
                    SUBTRACT 1 FROM FIRST-WIRE-X-COUNTER
                    SET FIRST-WIRE-PRESENT(FIRST-WIRE-X-COUNTER, FIRST-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-RIGHT 
                PERFORM LEN TIMES
                    ADD 1 TO FIRST-WIRE-X-COUNTER
                    SET FIRST-WIRE-PRESENT(FIRST-WIRE-X-COUNTER, FIRST-WIRE-Y-COUNTER) TO TRUE 
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-DOWN 
                PERFORM LEN TIMES
                    SUBTRACT 1 FROM FIRST-WIRE-Y-COUNTER
                    SET FIRST-WIRE-PRESENT(FIRST-WIRE-X-COUNTER, FIRST-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
        END-EVALUATE
    ELSE
        EVALUATE DIRECTION
            WHEN DIR-UP
                PERFORM LEN TIMES
                    ADD 1 TO SECOND-WIRE-Y-COUNTER
                    SET SECOND-WIRE-PRESENT(SECOND-WIRE-X-COUNTER,SECOND-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-LEFT 
                PERFORM LEN TIMES
                    SUBTRACT 1 FROM SECOND-WIRE-X-COUNTER
                    SET SECOND-WIRE-PRESENT(SECOND-WIRE-X-COUNTER, SECOND-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-RIGHT 
                PERFORM LEN TIMES
                    ADD 1 TO SECOND-WIRE-X-COUNTER
                    SET SECOND-WIRE-PRESENT(SECOND-WIRE-X-COUNTER, SECOND-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
            WHEN DIR-DOWN 
                PERFORM LEN TIMES
                    SUBTRACT 1 FROM SECOND-WIRE-Y-COUNTER
                    SET SECOND-WIRE-PRESENT(SECOND-WIRE-X-COUNTER, SECOND-WIRE-Y-COUNTER) TO TRUE
                    PERFORM 0350-CHECK-IF-POINT-IS-INTERSECTION
                END-PERFORM
        END-EVALUATE
    END-IF
    .
0300-END.

0350-CHECK-IF-POINT-IS-INTERSECTION.
    IF DRAW-FIRST-WIRE
        IF SECOND-WIRE-PRESENT(FIRST-WIRE-X-COUNTER, FIRST-WIRE-Y-COUNTER) 
            ADD 1 TO INT-COUNT OF INTERSECTIONS
            MOVE FIRST-WIRE-X-COUNTER TO X-CORD IN INTERSECT-COORDINATES(INT-COUNT OF INTERSECTIONS)
            MOVE FIRST-WIRE-Y-COUNTER TO Y-CORD IN INTERSECT-COORDINATES(INT-COUNT OF INTERSECTIONS)
        END-IF
    ELSE 
        IF FIRST-WIRE-PRESENT(SECOND-WIRE-X-COUNTER, SECOND-WIRE-Y-COUNTER) 
            ADD 1 TO INT-COUNT OF INTERSECTIONS
            MOVE SECOND-WIRE-X-COUNTER TO X-CORD IN INTERSECT-COORDINATES(INT-COUNT OF INTERSECTIONS)
            MOVE SECOND-WIRE-Y-COUNTER TO Y-CORD IN INTERSECT-COORDINATES(INT-COUNT OF INTERSECTIONS)
        END-IF
    END-IF
    .
0350-END.

0400-FIND-SHORTEST-MANHATTAN-DISTANCE.
    MOVE 0 TO COUNTER
    MOVE 999999 TO SMALLEST-MANHATTAN
    PERFORM INT-COUNT OF INTERSECTIONS TIMES
        COMPUTE X-DIST = X-CORD(COUNTER) - BOARD-CENTER
        COMPUTE Y-DIST = Y-CORD(COUNTER) - BOARD-CENTER 
        COMPUTE COMPARE-MANHATTAN = X-DIST + Y-DIST
        IF COMPARE-MANHATTAN LESS THAN SMALLEST-MANHATTAN
            MOVE COMPARE-MANHATTAN TO SMALLEST-MANHATTAN
        END-IF
        ADD 1 TO COUNTER
    END-PERFORM
    .
0400-END.

END PROGRAM WIREFIRE.

IDENTIFICATION DIVISION.
PROGRAM-ID. SEP.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 SEP-COUNTER                     PIC 9(9) COMP-3.
    01 STARTING-POINT                  PIC 9(5) COMP-3.
    01 TEMP-NUMERIC                    PIC 9(3).
LINKAGE SECTION.
    01  X-INPUT-LINE                   PIC X(2000).
    01  X-SEP-CHAR                     PIC X(1).
    01  X-RET-TABLE.
    02 CMAX                           PIC 9(5) COMP-3.
        02 CODE-ARRAY OCCURS 0 TO 9999 TIMES DEPENDING ON CMAX.
                07 VAL                    PIC X(5).

PROCEDURE DIVISION USING X-INPUT-LINE
                         X-SEP-CHAR
                         X-RET-TABLE.

MAIN SECTION.
MN-00.
    DISPLAY 'SEP INIT'
    INITIALIZE SEP-COUNTER, X-RET-TABLE.
    MOVE 1 TO STARTING-POINT.
  
    INSPECT X-INPUT-LINE TALLYING SEP-COUNTER FOR ALL
          X-SEP-CHAR.
    IF SEP-COUNTER < 9999
        ADD 1 TO SEP-COUNTER
    ELSE
        MOVE 9999 TO SEP-COUNTER
    END-IF
    DISPLAY SEP-COUNTER
    PERFORM SEP-COUNTER TIMES
        ADD  1  TO CMAX OF X-RET-TABLE
        UNSTRING X-INPUT-LINE DELIMITED BY X-SEP-CHAR
            INTO CODE-ARRAY(CMAX OF X-RET-TABLE)
            WITH POINTER STARTING-POINT
        END-UNSTRING
    
  END-PERFORM
  GOBACK.

END PROGRAM SEP.
